backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_3
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 224
      - 224
      - 3
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_95
      padding: valid
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: conv2d_95
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_95
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_95
        - 0
        - 0
        - {}
    name: batch_normalization_95
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_144
      trainable: true
    inbound_nodes:
    - - - batch_normalization_95
        - 0
        - 0
        - {}
    name: activation_144
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_96
      padding: valid
      strides: &id002 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_144
        - 0
        - 0
        - {}
    name: conv2d_96
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_96
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_96
        - 0
        - 0
        - {}
    name: batch_normalization_96
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_145
      trainable: true
    inbound_nodes:
    - - - batch_normalization_96
        - 0
        - 0
        - {}
    name: activation_145
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_97
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_145
        - 0
        - 0
        - {}
    name: conv2d_97
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_97
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_97
        - 0
        - 0
        - {}
    name: batch_normalization_97
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_146
      trainable: true
    inbound_nodes:
    - - - batch_normalization_97
        - 0
        - 0
        - {}
    name: activation_146
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_6
      padding: valid
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - activation_146
        - 0
        - 0
        - {}
    name: max_pooling2d_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_98
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_6
        - 0
        - 0
        - {}
    name: conv2d_98
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_98
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_98
        - 0
        - 0
        - {}
    name: batch_normalization_98
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_147
      trainable: true
    inbound_nodes:
    - - - batch_normalization_98
        - 0
        - 0
        - {}
    name: activation_147
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_99
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_147
        - 0
        - 0
        - {}
    name: conv2d_99
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_99
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_99
        - 0
        - 0
        - {}
    name: batch_normalization_99
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_148
      trainable: true
    inbound_nodes:
    - - - batch_normalization_99
        - 0
        - 0
        - {}
    name: activation_148
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_7
      padding: valid
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - activation_148
        - 0
        - 0
        - {}
    name: max_pooling2d_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_103
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_7
        - 0
        - 0
        - {}
    name: conv2d_103
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_103
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_103
        - 0
        - 0
        - {}
    name: batch_normalization_103
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_152
      trainable: true
    inbound_nodes:
    - - - batch_normalization_103
        - 0
        - 0
        - {}
    name: activation_152
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_101
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_7
        - 0
        - 0
        - {}
    name: conv2d_101
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_104
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_152
        - 0
        - 0
        - {}
    name: conv2d_104
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_101
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_101
        - 0
        - 0
        - {}
    name: batch_normalization_101
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_104
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_104
        - 0
        - 0
        - {}
    name: batch_normalization_104
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_150
      trainable: true
    inbound_nodes:
    - - - batch_normalization_101
        - 0
        - 0
        - {}
    name: activation_150
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_153
      trainable: true
    inbound_nodes:
    - - - batch_normalization_104
        - 0
        - 0
        - {}
    name: activation_153
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_10
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_7
        - 0
        - 0
        - {}
    name: average_pooling2d_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_100
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_7
        - 0
        - 0
        - {}
    name: conv2d_100
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_102
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_150
        - 0
        - 0
        - {}
    name: conv2d_102
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_105
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_153
        - 0
        - 0
        - {}
    name: conv2d_105
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_106
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_10
        - 0
        - 0
        - {}
    name: conv2d_106
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_100
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_100
        - 0
        - 0
        - {}
    name: batch_normalization_100
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_102
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_102
        - 0
        - 0
        - {}
    name: batch_normalization_102
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_105
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_105
        - 0
        - 0
        - {}
    name: batch_normalization_105
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_106
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_106
        - 0
        - 0
        - {}
    name: batch_normalization_106
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_149
      trainable: true
    inbound_nodes:
    - - - batch_normalization_100
        - 0
        - 0
        - {}
    name: activation_149
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_151
      trainable: true
    inbound_nodes:
    - - - batch_normalization_102
        - 0
        - 0
        - {}
    name: activation_151
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_154
      trainable: true
    inbound_nodes:
    - - - batch_normalization_105
        - 0
        - 0
        - {}
    name: activation_154
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_155
      trainable: true
    inbound_nodes:
    - - - batch_normalization_106
        - 0
        - 0
        - {}
    name: activation_155
  - class_name: Concatenate
    config:
      axis: 3
      dtype: float32
      name: mixed0
      trainable: true
    inbound_nodes:
    - - - activation_149
        - 0
        - 0
        - &id003 {}
      - - activation_151
        - 0
        - 0
        - *id003
      - - activation_154
        - 0
        - 0
        - *id003
      - - activation_155
        - 0
        - 0
        - *id003
    name: mixed0
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_110
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_110
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_110
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_110
        - 0
        - 0
        - {}
    name: batch_normalization_110
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_159
      trainable: true
    inbound_nodes:
    - - - batch_normalization_110
        - 0
        - 0
        - {}
    name: activation_159
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_108
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_108
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_111
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_159
        - 0
        - 0
        - {}
    name: conv2d_111
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_108
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_108
        - 0
        - 0
        - {}
    name: batch_normalization_108
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_111
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_111
        - 0
        - 0
        - {}
    name: batch_normalization_111
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_157
      trainable: true
    inbound_nodes:
    - - - batch_normalization_108
        - 0
        - 0
        - {}
    name: activation_157
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_160
      trainable: true
    inbound_nodes:
    - - - batch_normalization_111
        - 0
        - 0
        - {}
    name: activation_160
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_11
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: average_pooling2d_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_107
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_107
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_109
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_157
        - 0
        - 0
        - {}
    name: conv2d_109
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_112
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_160
        - 0
        - 0
        - {}
    name: conv2d_112
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_113
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_113
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_107
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_107
        - 0
        - 0
        - {}
    name: batch_normalization_107
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_109
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_109
        - 0
        - 0
        - {}
    name: batch_normalization_109
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_112
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_112
        - 0
        - 0
        - {}
    name: batch_normalization_112
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_113
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_113
        - 0
        - 0
        - {}
    name: batch_normalization_113
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_156
      trainable: true
    inbound_nodes:
    - - - batch_normalization_107
        - 0
        - 0
        - {}
    name: activation_156
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_158
      trainable: true
    inbound_nodes:
    - - - batch_normalization_109
        - 0
        - 0
        - {}
    name: activation_158
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_161
      trainable: true
    inbound_nodes:
    - - - batch_normalization_112
        - 0
        - 0
        - {}
    name: activation_161
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_162
      trainable: true
    inbound_nodes:
    - - - batch_normalization_113
        - 0
        - 0
        - {}
    name: activation_162
  - class_name: Concatenate
    config:
      axis: 3
      dtype: float32
      name: mixed1
      trainable: true
    inbound_nodes:
    - - - activation_156
        - 0
        - 0
        - &id004 {}
      - - activation_158
        - 0
        - 0
        - *id004
      - - activation_161
        - 0
        - 0
        - *id004
      - - activation_162
        - 0
        - 0
        - *id004
    name: mixed1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_117
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_117
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_117
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_117
        - 0
        - 0
        - {}
    name: batch_normalization_117
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_166
      trainable: true
    inbound_nodes:
    - - - batch_normalization_117
        - 0
        - 0
        - {}
    name: activation_166
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_115
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_115
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_118
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_166
        - 0
        - 0
        - {}
    name: conv2d_118
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_115
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_115
        - 0
        - 0
        - {}
    name: batch_normalization_115
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_118
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_118
        - 0
        - 0
        - {}
    name: batch_normalization_118
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_164
      trainable: true
    inbound_nodes:
    - - - batch_normalization_115
        - 0
        - 0
        - {}
    name: activation_164
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_167
      trainable: true
    inbound_nodes:
    - - - batch_normalization_118
        - 0
        - 0
        - {}
    name: activation_167
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_12
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: average_pooling2d_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_114
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_114
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_116
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_164
        - 0
        - 0
        - {}
    name: conv2d_116
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_119
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_167
        - 0
        - 0
        - {}
    name: conv2d_119
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_120
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_12
        - 0
        - 0
        - {}
    name: conv2d_120
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_114
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_114
        - 0
        - 0
        - {}
    name: batch_normalization_114
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_116
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_116
        - 0
        - 0
        - {}
    name: batch_normalization_116
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_119
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_119
        - 0
        - 0
        - {}
    name: batch_normalization_119
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_120
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_120
        - 0
        - 0
        - {}
    name: batch_normalization_120
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_163
      trainable: true
    inbound_nodes:
    - - - batch_normalization_114
        - 0
        - 0
        - {}
    name: activation_163
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_165
      trainable: true
    inbound_nodes:
    - - - batch_normalization_116
        - 0
        - 0
        - {}
    name: activation_165
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_168
      trainable: true
    inbound_nodes:
    - - - batch_normalization_119
        - 0
        - 0
        - {}
    name: activation_168
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_169
      trainable: true
