backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_4
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 224
      - 224
      - 3
      dtype: float32
      name: input_4
      sparse: false
    inbound_nodes: []
    name: input_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_189
      padding: valid
      strides: !!python/tuple
      - 2
      - 2
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - input_4
        - 0
        - 0
        - {}
    name: conv2d_189
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_189
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_189
        - 0
        - 0
        - {}
    name: batch_normalization_189
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_238
      trainable: false
    inbound_nodes:
    - - - batch_normalization_189
        - 0
        - 0
        - {}
    name: activation_238
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_190
      padding: valid
      strides: &id002 !!python/tuple
      - 1
      - 1
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_238
        - 0
        - 0
        - {}
    name: conv2d_190
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_190
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_190
        - 0
        - 0
        - {}
    name: batch_normalization_190
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_239
      trainable: false
    inbound_nodes:
    - - - batch_normalization_190
        - 0
        - 0
        - {}
    name: activation_239
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_191
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_239
        - 0
        - 0
        - {}
    name: conv2d_191
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_191
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_191
        - 0
        - 0
        - {}
    name: batch_normalization_191
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_240
      trainable: false
    inbound_nodes:
    - - - batch_normalization_191
        - 0
        - 0
        - {}
    name: activation_240
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_10
      padding: valid
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: false
    inbound_nodes:
    - - - activation_240
        - 0
        - 0
        - {}
    name: max_pooling2d_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_192
      padding: valid
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_10
        - 0
        - 0
        - {}
    name: conv2d_192
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_192
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_192
        - 0
        - 0
        - {}
    name: batch_normalization_192
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_241
      trainable: false
    inbound_nodes:
    - - - batch_normalization_192
        - 0
        - 0
        - {}
    name: activation_241
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_193
      padding: valid
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_241
        - 0
        - 0
        - {}
    name: conv2d_193
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_193
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_193
        - 0
        - 0
        - {}
    name: batch_normalization_193
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_242
      trainable: false
    inbound_nodes:
    - - - batch_normalization_193
        - 0
        - 0
        - {}
    name: activation_242
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_11
      padding: valid
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      trainable: false
    inbound_nodes:
    - - - activation_242
        - 0
        - 0
        - {}
    name: max_pooling2d_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_197
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_197
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_197
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_197
        - 0
        - 0
        - {}
    name: batch_normalization_197
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_246
      trainable: false
    inbound_nodes:
    - - - batch_normalization_197
        - 0
        - 0
        - {}
    name: activation_246
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_195
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_195
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_198
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_246
        - 0
        - 0
        - {}
    name: conv2d_198
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_195
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_195
        - 0
        - 0
        - {}
    name: batch_normalization_195
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_198
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_198
        - 0
        - 0
        - {}
    name: batch_normalization_198
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_244
      trainable: false
    inbound_nodes:
    - - - batch_normalization_195
        - 0
        - 0
        - {}
    name: activation_244
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_247
      trainable: false
    inbound_nodes:
    - - - batch_normalization_198
        - 0
        - 0
        - {}
    name: activation_247
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_19
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 1
      - 1
      trainable: false
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: average_pooling2d_19
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_194
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_194
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_196
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_244
        - 0
        - 0
        - {}
    name: conv2d_196
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_199
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_247
        - 0
        - 0
        - {}
    name: conv2d_199
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_200
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_19
        - 0
        - 0
        - {}
    name: conv2d_200
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_194
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_194
        - 0
        - 0
        - {}
    name: batch_normalization_194
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_196
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_196
        - 0
        - 0
        - {}
    name: batch_normalization_196
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_199
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_199
        - 0
        - 0
        - {}
    name: batch_normalization_199
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_200
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_200
        - 0
        - 0
        - {}
    name: batch_normalization_200
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_243
      trainable: false
    inbound_nodes:
    - - - batch_normalization_194
        - 0
        - 0
        - {}
    name: activation_243
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_245
      trainable: false
    inbound_nodes:
    - - - batch_normalization_196
        - 0
        - 0
        - {}
    name: activation_245
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_248
      trainable: false
    inbound_nodes:
    - - - batch_normalization_199
        - 0
        - 0
        - {}
    name: activation_248
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_249
      trainable: false
    inbound_nodes:
    - - - batch_normalization_200
        - 0
        - 0
        - {}
    name: activation_249
  - class_name: Concatenate
    config:
      axis: 3
      dtype: float32
      name: mixed0
      trainable: false
    inbound_nodes:
    - - - activation_243
        - 0
        - 0
        - &id003 {}
      - - activation_245
        - 0
        - 0
        - *id003
      - - activation_248
        - 0
        - 0
        - *id003
      - - activation_249
        - 0
        - 0
        - *id003
    name: mixed0
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_204
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_204
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_204
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_204
        - 0
        - 0
        - {}
    name: batch_normalization_204
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_253
      trainable: false
    inbound_nodes:
    - - - batch_normalization_204
        - 0
        - 0
        - {}
    name: activation_253
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_202
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_202
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_205
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_253
        - 0
        - 0
        - {}
    name: conv2d_205
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_202
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_202
        - 0
        - 0
        - {}
    name: batch_normalization_202
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_205
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_205
        - 0
        - 0
        - {}
    name: batch_normalization_205
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_251
      trainable: false
    inbound_nodes:
    - - - batch_normalization_202
        - 0
        - 0
        - {}
    name: activation_251
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_254
      trainable: false
    inbound_nodes:
    - - - batch_normalization_205
        - 0
        - 0
        - {}
    name: activation_254
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_20
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 1
      - 1
      trainable: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: average_pooling2d_20
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_201
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_201
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_203
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_251
        - 0
        - 0
        - {}
    name: conv2d_203
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_206
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_254
        - 0
        - 0
        - {}
    name: conv2d_206
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_207
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_20
        - 0
        - 0
        - {}
    name: conv2d_207
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_201
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_201
        - 0
        - 0
        - {}
    name: batch_normalization_201
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_203
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_203
        - 0
        - 0
        - {}
    name: batch_normalization_203
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_206
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_206
        - 0
        - 0
        - {}
    name: batch_normalization_206
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_207
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_207
        - 0
        - 0
        - {}
    name: batch_normalization_207
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_250
      trainable: false
    inbound_nodes:
    - - - batch_normalization_201
        - 0
        - 0
        - {}
    name: activation_250
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_252
      trainable: false
    inbound_nodes:
    - - - batch_normalization_203
        - 0
        - 0
        - {}
    name: activation_252
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_255
      trainable: false
    inbound_nodes:
    - - - batch_normalization_206
        - 0
        - 0
        - {}
    name: activation_255
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_256
      trainable: false
    inbound_nodes:
    - - - batch_normalization_207
        - 0
        - 0
        - {}
    name: activation_256
  - class_name: Concatenate
    config:
      axis: 3
      dtype: float32
      name: mixed1
      trainable: false
    inbound_nodes:
    - - - activation_250
        - 0
        - 0
        - &id004 {}
      - - activation_252
        - 0
        - 0
        - *id004
      - - activation_255
        - 0
        - 0
        - *id004
      - - activation_256
        - 0
        - 0
        - *id004
    name: mixed1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_211
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_211
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_211
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_211
        - 0
        - 0
        - {}
    name: batch_normalization_211
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_260
      trainable: false
    inbound_nodes:
    - - - batch_normalization_211
        - 0
        - 0
        - {}
    name: activation_260
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_209
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_209
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_212
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_260
        - 0
        - 0
        - {}
    name: conv2d_212
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_209
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_209
        - 0
        - 0
        - {}
    name: batch_normalization_209
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_212
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_212
        - 0
        - 0
        - {}
    name: batch_normalization_212
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_258
      trainable: false
    inbound_nodes:
    - - - batch_normalization_209
        - 0
        - 0
        - {}
    name: activation_258
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_261
      trainable: false
    inbound_nodes:
    - - - batch_normalization_212
        - 0
        - 0
        - {}
    name: activation_261
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_21
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      strides: !!python/tuple
      - 1
      - 1
      trainable: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: average_pooling2d_21
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_208
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_208
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_210
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_258
        - 0
        - 0
        - {}
    name: conv2d_210
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_213
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - activation_261
        - 0
        - 0
        - {}
    name: conv2d_213
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      - 1
      name: conv2d_214
      padding: same
      strides: *id002
      trainable: false
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_21
        - 0
        - 0
        - {}
    name: conv2d_214
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_208
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_208
        - 0
        - 0
        - {}
    name: batch_normalization_208
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_210
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_210
        - 0
        - 0
        - {}
    name: batch_normalization_210
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_213
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_213
        - 0
        - 0
        - {}
    name: batch_normalization_213
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_214
      scale: false
      trainable: false
    inbound_nodes:
    - - - conv2d_214
        - 0
        - 0
        - {}
    name: batch_normalization_214
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_257
      trainable: false
    inbound_nodes:
    - - - batch_normalization_208
        - 0
        - 0
        - {}
    name: activation_257
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_259
      trainable: false
    inbound_nodes:
    - - - batch_normalization_210
        - 0
        - 0
        - {}
    name: activation_259
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_262
      trainable: false
    inbound_nodes:
    - - - batch_normalization_213
        - 0
        - 0
        - {}
    name: activation_262
